Revit.Elements.Views.SectionView
A Revit ViewSection

Revit.Elements.Views.SectionView.#ctor(Autodesk.Revit.DB.ViewSection)
Private constructor

Revit.Elements.Views.SectionView.#ctor(Autodesk.Revit.DB.BoundingBoxXYZ)
Private constructor

Revit.Elements.Views.SectionView.InitSectionView(Autodesk.Revit.DB.ViewSection)
Initialize a SectionView element

Revit.Elements.Views.SectionView.InitSectionView(Autodesk.Revit.DB.BoundingBoxXYZ)
Initialize a SectionView element

Revit.Elements.Views.SectionView.InternalSetSectionView(Autodesk.Revit.DB.ViewSection)
Set the InternalViewSection property and the associated element id and unique id
floor:

Revit.Elements.Views.SectionView.ByBoundingBox(Autodesk.DesignScript.Geometry.BoundingBox)
Create a Revit ViewSection by a bounding box
box: The bounding box of the view in meters
Returns:

Revit.Elements.Views.SectionView.ByCoordinateSystemMinPointMaxPoint(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Creates a Revit ViewSection by a specified corrdinate system, minPoint and maxPoint
cs:
minPoint:
maxPoint:
Returns:

Revit.Elements.Views.SectionView.FromExisting(Autodesk.Revit.DB.ViewSection,System.Boolean)
Create a View from a user selected Element.
view:
isRevitOwned:
Returns:

Revit.Elements.Views.SectionView.InternalViewSection
An internal handle on the Revit element

Revit.Elements.Views.SectionView.InternalElement
Reference to the Element